In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
s = pd.Series([1,3,5,np.nan,6,9])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    9.0
dtype: float64

In [6]:
s.dtype
s.dtypes

dtype('float64')

dtype('float64')

In [8]:
dates = pd.date_range('20230101',periods=6)
dates

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
type(dates)
type(s)

pandas.core.indexes.datetimes.DatetimeIndex

pandas.core.series.Series

In [11]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))

In [12]:
df

                   A         B         C         D
2023-01-01 -0.111874  0.877763 -3.284433 -1.159260
2023-01-02  0.841433  0.076219  0.461902 -1.311436
2023-01-03  0.502094  0.179865 -1.174281 -0.202441
2023-01-04  0.654074  0.330935  1.313095  0.602093
2023-01-05  0.126607  1.734405 -0.458116 -0.437503
2023-01-06  0.320465 -0.930536 -0.324344  1.634312

In [101]:
dic = {'A':1,
       'B':pd.Timestamp('20230101'),
       'C':pd.Series(1,index=list(range(4)),dtype='float32'),
       'D':np.array([3]*4,dtype='int32'),
       'E':pd.Categorical(['test','train','test','da']),
       'F':'foo'}
dic

{'A': 1,
 'B': Timestamp('2023-01-01 00:00:00'),
 'C': 0    1.0
 1    1.0
 2    1.0
 3    1.0
 dtype: float32,
 'D': array([3, 3, 3, 3]),
 'E': ['test', 'train', 'test', 'da']
 Categories (3, object): ['da', 'test', 'train'],
 'F': 'foo'}

In [102]:
df2 = pd.DataFrame(dic)
df2

   A          B    C  D      E    F
0  1 2023-01-01  1.0  3   test  foo
1  1 2023-01-01  1.0  3  train  foo
2  1 2023-01-01  1.0  3   test  foo
3  1 2023-01-01  1.0  3     da  foo

In [15]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[ns](1), float32(1), int32(1), int64(1), object(1)
memory usage: 296.0+ bytes

In [18]:
df.index

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [20]:
df.values

array([[-0.11187385,  0.87776348, -3.28443348, -1.15926046],
       [ 0.84143276,  0.07621906,  0.46190155, -1.31143629],
       [ 0.50209447,  0.17986524, -1.17428067, -0.20244098],
       [ 0.65407414,  0.33093457,  1.3130949 ,  0.60209343],
       [ 0.12660663,  1.73440528, -0.45811637, -0.43750283],
       [ 0.3204645 , -0.93053566, -0.32434433,  1.63431221]])

In [21]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.388800  0.378109 -0.577696 -0.145706
std    0.349906  0.887064  1.575860  1.113755
min   -0.111874 -0.930536 -3.284433 -1.311436
25%    0.175071  0.102131 -0.995240 -0.978821
50%    0.411279  0.255400 -0.391230 -0.319972
75%    0.616079  0.741056  0.265340  0.400960
max    0.841433  1.734405  1.313095  1.634312

In [22]:
df.T

   2023-01-01  2023-01-02  2023-01-03  2023-01-04  2023-01-05  2023-01-06
A   -0.111874    0.841433    0.502094    0.654074    0.126607    0.320465
B    0.877763    0.076219    0.179865    0.330935    1.734405   -0.930536
C   -3.284433    0.461902   -1.174281    1.313095   -0.458116   -0.324344
D   -1.159260   -1.311436   -0.202441    0.602093   -0.437503    1.634312

In [25]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2023-01-01 -1.159260 -3.284433  0.877763 -0.111874
2023-01-02 -1.311436  0.461902  0.076219  0.841433
2023-01-03 -0.202441 -1.174281  0.179865  0.502094
2023-01-04  0.602093  1.313095  0.330935  0.654074
2023-01-05 -0.437503 -0.458116  1.734405  0.126607
2023-01-06  1.634312 -0.324344 -0.930536  0.320465

In [26]:
df.sort_values('B')

                   A         B         C         D
2023-01-06  0.320465 -0.930536 -0.324344  1.634312
2023-01-02  0.841433  0.076219  0.461902 -1.311436
2023-01-03  0.502094  0.179865 -1.174281 -0.202441
2023-01-04  0.654074  0.330935  1.313095  0.602093
2023-01-01 -0.111874  0.877763 -3.284433 -1.159260
2023-01-05  0.126607  1.734405 -0.458116 -0.437503

In [28]:
df.A
df['A']

2023-01-01    True
2023-01-02    True
2023-01-03    True
2023-01-04    True
2023-01-05    True
2023-01-06    True
Freq: D, Name: A, dtype: bool

In [29]:
df[:3] # 行切片

                   A         B         C         D
2023-01-01 -0.111874  0.877763 -3.284433 -1.159260
2023-01-02  0.841433  0.076219  0.461902 -1.311436
2023-01-03  0.502094  0.179865 -1.174281 -0.202441

In [30]:
df.loc[:,['A','C']]

                   A         C
2023-01-01 -0.111874 -3.284433
2023-01-02  0.841433  0.461902
2023-01-03  0.502094 -1.174281
2023-01-04  0.654074  1.313095
2023-01-05  0.126607 -0.458116
2023-01-06  0.320465 -0.324344

In [32]:
type(df.iloc[1,[1,2]])

pandas.core.series.Series

In [33]:
df.loc[dates[0],'A']

-0.1118738451519533

In [34]:
df.at[dates[0],'A'] # 同上

-0.1118738451519533

In [35]:
df.iloc[1,1]

0.07621905792502404

In [36]:
df.iat[1,1]

0.07621905792502404

In [38]:
df[df.A>0]

                   A         B         C         D
2023-01-02  0.841433  0.076219  0.461902 -1.311436
2023-01-03  0.502094  0.179865 -1.174281 -0.202441
2023-01-04  0.654074  0.330935  1.313095  0.602093
2023-01-05  0.126607  1.734405 -0.458116 -0.437503
2023-01-06  0.320465 -0.930536 -0.324344  1.634312

In [42]:
df[df>0]

                   A         B         C         D
2023-01-01       NaN  0.877763       NaN       NaN
2023-01-02  0.841433  0.076219  0.461902       NaN
2023-01-03  0.502094  0.179865       NaN       NaN
2023-01-04  0.654074  0.330935  1.313095  0.602093
2023-01-05  0.126607  1.734405       NaN       NaN
2023-01-06  0.320465       NaN       NaN  1.634312

In [46]:
df2.shape

(4, 6)

In [47]:
df['E']=['one','one','two','three','four','three']
df

                   A         B         C         D      E
2023-01-01 -0.111874  0.877763 -3.284433 -1.159260    one
2023-01-02  0.841433  0.076219  0.461902 -1.311436    one
2023-01-03  0.502094  0.179865 -1.174281 -0.202441    two
2023-01-04  0.654074  0.330935  1.313095  0.602093  three
2023-01-05  0.126607  1.734405 -0.458116 -0.437503   four
2023-01-06  0.320465 -0.930536 -0.324344  1.634312  three

In [49]:
df[df['E'].isin(['two','four'])]

                   A         B         C         D     E
2023-01-03  0.502094  0.179865 -1.174281 -0.202441   two
2023-01-05  0.126607  1.734405 -0.458116 -0.437503  four

In [55]:
df['G'] = [i for i in range(6)]
df

                   A         B         C         D      E  G
2023-01-01 -0.111874  0.877763 -3.284433 -1.159260    one  0
2023-01-02  0.841433  0.076219  0.461902 -1.311436    one  1
2023-01-03  0.502094  0.179865 -1.174281 -0.202441    two  2
2023-01-04  0.654074  0.330935  1.313095  0.602093  three  3
2023-01-05  0.126607  1.734405 -0.458116 -0.437503   four  4
2023-01-06  0.320465 -0.930536 -0.324344  1.634312  three  5

In [58]:
s2	=pd.Series([1,3,2,4,6,5],index=pd.date_range('20230101',	periods=6))
df['H']=s2
df

                   A         B         C         D      E  G  H
2023-01-01 -0.111874  0.877763 -3.284433 -1.159260    one  0  1
2023-01-02  0.841433  0.076219  0.461902 -1.311436    one  1  3
2023-01-03  0.502094  0.179865 -1.174281 -0.202441    two  2  2
2023-01-04  0.654074  0.330935  1.313095  0.602093  three  3  4
2023-01-05  0.126607  1.734405 -0.458116 -0.437503   four  4  6
2023-01-06  0.320465 -0.930536 -0.324344  1.634312  three  5  5

In [60]:
type(np.array(5))

numpy.ndarray

In [61]:
np.array(5)

array(5)

In [63]:
type(np.array([5]))

numpy.ndarray

In [64]:
df.isnull()

                A      B      C      D      E      G      H
2023-01-01  False  False  False  False  False  False  False
2023-01-02  False  False  False  False  False  False  False
2023-01-03  False  False  False  False  False  False  False
2023-01-04  False  False  False  False  False  False  False
2023-01-05  False  False  False  False  False  False  False
2023-01-06  False  False  False  False  False  False  False

In [65]:
df.mean()

C:\Users\fzh00\AppData\Local\Temp\ipykernel_28756\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

A    0.388800
B    0.378109
C   -0.577696
D   -0.145706
G    2.500000
H    3.500000
dtype: float64

In [66]:
df.mean(1)

C:\Users\fzh00\AppData\Local\Temp\ipykernel_28756\3808537418.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(1)

2023-01-01   -0.446301
2023-01-02    0.678020
2023-01-03    0.550873
2023-01-04    1.650033
2023-01-05    1.827565
2023-01-06    1.783316
Freq: D, dtype: float64

In [69]:
s3 = pd.Series([i for i in range(10)])
s3

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [71]:
s = pd.Series([1,3,5,np.nan,6,8],index=dates).shift(1)
s

2023-01-01    NaN
2023-01-02    1.0
2023-01-03    3.0
2023-01-04    5.0
2023-01-05    NaN
2023-01-06    6.0
Freq: D, dtype: float64

In [75]:
df.iloc[:,:-3].sub(s,axis='index')

                   A         B         C         D
2023-01-01       NaN       NaN       NaN       NaN
2023-01-02 -0.158567 -0.923781 -0.538098 -2.311436
2023-01-03 -2.497906 -2.820135 -4.174281 -3.202441
2023-01-04 -4.345926 -4.669065 -3.686905 -4.397907
2023-01-05       NaN       NaN       NaN       NaN
2023-01-06 -5.679535 -6.930536 -6.324344 -4.365688

In [77]:
df.apply(np.cumsum)

,A,B,C,D,E,G,H
2023-01-01,-0.111874,0.877763,-3.284433,-1.159260,one,0,1
2023-01-02,0.729559,0.953983,-2.822532,-2.470697,oneone,1,4
2023-01-03,1.231653,1.133848,-3.996813,-2.673138,oneonetwo,3,6
2023-01-04,1.885728,1.464782,-2.683718,-2.071044,oneonetwothree,6,10
2023-01-05,2.012334,3.199188,-3.141834,-2.508547,oneonetwothreefour,10,16
2023-01-06,2.332799,2.268652,-3.466178,-0.874235,oneonetwothreefourthree,15,21

In [79]:
df.iloc[:,:-3].apply(lambda x:x.max()-x.min())

A    0.953307
B    2.664941
C    4.597528
D    2.945749
dtype: float64

In [81]:
speeds = pd.DataFrame([
         ("bird", "Falconiformes", 389.0),
        ("bird", "Psittaciformes", 24.0),
       ("mammal", "Primates", np.nan),
        ("mammal", "Carnivora", 80.2),
        ("mammal", "Carnivora", 58),
    ],
   index=["falcon", "parrot", "lion", "monkey", "leopard"],
    columns=("class", "order", "max_speed"),
)
speeds

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal        Primates        NaN
monkey   mammal       Carnivora       80.2
leopard  mammal       Carnivora       58.0

In [83]:
speeds.groupby(('class')).sum()

C:\Users\fzh00\AppData\Local\Temp\ipykernel_28756\2378020497.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  speeds.groupby(('class')).sum()

        max_speed
class
bird        413.0
mammal      138.2

In [84]:
speeds.groupby(('class')).agg({'max_speed':sum})

        max_speed
class
bird        413.0
mammal      138.2

In [90]:
df =pd.DataFrame({"X": ["B", "B", "A", "A"], "Y": [1, 2, 3, 4]})
df

   X  Y
0  B  1
1  B  2
2  A  3
3  A  4

In [92]:
df.groupby('X',sort=False).sum()

   Y
X
B  3
A  7

In [94]:
df_list = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]
df=pd.DataFrame(df_list, columns=["a", "b", "c"])
df

   a    b  c
0  1  2.0  3
1  1  NaN  4
2  2  1.0  3
3  1  2.0  2

In [95]:
df.groupby('b').sum()

     a  c
b
1.0  2  3
2.0  2  5

In [96]:
df.groupby('b',dropna=False).sum()

     a  c
b
1.0  2  3
2.0  2  5
NaN  1  4

In [99]:
df.groupby('b').groups

{1.0: [2], 2.0: [0, 3]}

In [105]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    })
df

     A      B         C         D
0  foo    one  0.732543  0.763835
1  bar    one -1.305126 -0.411221
2  foo    two -0.947297 -0.327187
3  bar  three  0.063897  0.174010
4  foo    two -1.229077  0.340292
5  bar    two  2.569570 -0.560165
6  foo    one  0.325505 -0.271825
7  foo  three -0.787381 -0.214801

In [106]:
df.groupby(get_letter_type, axis=1).groups

NameError: name 'get_letter_type' is not defined

In [154]:
date1

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [108]:
df.groupby(['A','B']).groups

{('bar', 'one'): [1], ('bar', 'three'): [3], ('bar', 'two'): [5], ('foo', 'one'): [0, 6], ('foo', 'three'): [7], ('foo', 'two'): [2, 4]}

In [109]:
arrays = [
    ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
    ["one", "two", "one", "two", "one", "two", "one", "two"],
]
index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])
s = pd.Series(np.random.randn(8), index=index)
s

first  second
bar    one       1.497944
       two       0.249082
baz    one       0.875311
       two      -1.301371
foo    one       1.790177
       two      -0.654244
qux    one       0.703235
       two       0.953916
dtype: float64

In [111]:
s.groupby(level=0).sum()

first
bar    1.747026
baz   -0.426060
foo    1.135933
qux    1.657151
dtype: float64

In [112]:
s.groupby(level="second").sum()

second
one    4.866667
two   -0.752616
dtype: float64

In [ ]:
df.groupby([pd.Grouper(level=1), "A"]).sum()

In [113]:
def get_letter_type(letter):
    if letter.lower() in 'aeiou':
        return 'vowel'
    else:
        return 'consonant'

In [123]:
df

     A      B         C         D
0  foo    one  0.732543  0.763835
1  bar    one -1.305126 -0.411221
2  foo    two -0.947297 -0.327187
3  bar  three  0.063897  0.174010
4  foo    two -1.229077  0.340292
5  bar    two  2.569570 -0.560165
6  foo    one  0.325505 -0.271825
7  foo  three -0.787381 -0.214801

In [119]:
df.groupby(get_letter_type,axis=1).groups
df.groupby(get_letter_type,axis=1).sum()

{'consonant': ['B', 'C', 'D'], 'vowel': ['A']}

C:\Users\fzh00\AppData\Local\Temp\ipykernel_28756\2833651387.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(get_letter_type,axis=1).sum()

Empty DataFrame
Columns: [consonant, vowel]
Index: []

In [125]:
grouped = df.groupby(["A"])
grouped

In [126]:
grouped.groups

{'bar': [1, 3, 5], 'foo': [0, 2, 4, 6, 7]}

In [129]:
grouped['C'].sum()

A
bar    1.328341
foo   -1.905708
Name: C, dtype: float64

In [130]:
for name,group in grouped:
       print(name,group)

bar      A      B         C         D
1  bar    one -1.305126 -0.411221
3  bar  three  0.063897  0.174010
5  bar    two  2.569570 -0.560165
foo      A      B         C         D
0  foo    one  0.732543  0.763835
2  foo    two -0.947297 -0.327187
4  foo    two -1.229077  0.340292
6  foo    one  0.325505 -0.271825
7  foo  three -0.787381 -0.214801

C:\Users\fzh00\AppData\Local\Temp\ipykernel_28756\2411745281.py:1: FutureWarning: In a future version of pandas, a length 1 tuple will be returned when iterating over a groupby with a grouper equal to a list of length 1. Don't supply a list with a single grouper to avoid this warning.
  for name,group in grouped:

In [131]:
grouped.get_group('bar')

     A      B         C         D
1  bar    one -1.305126 -0.411221
3  bar  three  0.063897  0.174010
5  bar    two  2.569570 -0.560165

In [132]:
animals = pd.DataFrame(
    {
        "kind": ["cat", "dog", "cat", "dog"],
        "height": [9.1, 6.0, 9.5, 34.0],
        "weight": [7.9, 7.5, 9.9, 198.0],
    }
)
animals

  kind  height  weight
0  cat     9.1     7.9
1  dog     6.0     7.5
2  cat     9.5     9.9
3  dog    34.0   198.0

In [134]:
animals.groupby('kind').sum()
animals.groupby("kind", as_index=False).sum()

      height  weight
kind
cat     18.6    17.8
dog     40.0   205.5

  kind  height  weight
0  cat    18.6    17.8
1  dog    40.0   205.5

In [135]:
df.groupby("A")[["C", "D"]].max()

            C         D
A
bar  2.569570  0.174010
foo  0.732543  0.763835

In [137]:
grouped[["C", "D"]].aggregate("sum")

            C         D
A
bar  1.328341 -0.797375
foo -1.905708  0.290314

In [138]:
grouped.agg("sum")

C:\Users\fzh00\AppData\Local\Temp\ipykernel_28756\3450300443.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grouped.agg("sum")

            C         D
A
bar  1.328341 -0.797375
foo -1.905708  0.290314

In [139]:
df.groupby("A")["C"].agg(["sum", "mean", "std"])

          sum      mean       std
A
bar  1.328341  0.442780  1.964938
foo -1.905708 -0.381142  0.857933

In [140]:
animals.groupby("kind").agg(
    min_height=pd.NamedAgg(column="height", aggfunc="min"),
    max_height=pd.NamedAgg(column="height", aggfunc="max"),
    average_weight=pd.NamedAgg(column="weight", aggfunc="mean"),
)

      min_height  max_height  average_weight
kind
cat          9.1         9.5            8.90
dog          6.0        34.0          102.75

In [ ]:
animals.groupby("kind").agg(
    min_height=("height", "min"),
    max_height=("height", "max"),
    average_weight=("weight", "mean"),
)

In [145]:
speeds
grouped = speeds.groupby("class")["max_speed"]

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal        Primates        NaN
monkey   mammal       Carnivora       80.2
leopard  mammal       Carnivora       58.0

In [146]:
result = speeds.copy()
result["cumsum"] = grouped.cumsum()
result["diff"] = grouped.diff()
result

          class           order  max_speed  cumsum   diff
falcon     bird   Falconiformes      389.0   389.0    NaN
parrot     bird  Psittaciformes       24.0   413.0 -365.0
lion     mammal        Primates        NaN     NaN    NaN
monkey   mammal       Carnivora       80.2    80.2    NaN
leopard  mammal       Carnivora       58.0   138.2  -22.2

In [147]:
grouped = speeds.groupby("class")[["max_speed"]]
grouped.transform("cumsum")

         max_speed
falcon       389.0
parrot       413.0
lion           NaN
monkey        80.2
leopard      138.2

In [148]:
grouped.transform("sum")

         max_speed
falcon       413.0
parrot       413.0
lion         138.2
monkey       138.2
leopard      138.2

In [149]:
index = pd.date_range("10/1/1999", periods=1100)
ts = pd.Series(np.random.normal(0.5, 2, 1100), index)
ts = ts.rolling(window=100, min_periods=100).mean().dropna()
ts.head()

2000-01-08    0.664578
2000-01-09    0.647065
2000-01-10    0.550686
2000-01-11    0.572655
2000-01-12    0.533534
Freq: D, dtype: float64

In [150]:
ts.shape

(1001,)

In [151]:
index

DatetimeIndex(['1999-10-01', '1999-10-02', '1999-10-03', '1999-10-04',
               '1999-10-05', '1999-10-06', '1999-10-07', '1999-10-08',
               '1999-10-09', '1999-10-10',
               ...
               '2002-09-25', '2002-09-26', '2002-09-27', '2002-09-28',
               '2002-09-29', '2002-09-30', '2002-10-01', '2002-10-02',
               '2002-10-03', '2002-10-04'],
              dtype='datetime64[ns]', length=1100, freq='D')

In [152]:
date1 = pd.date_range("20130101", periods=6)
date2 = pd.date_range("1/1/2023", periods=6)
date1
date2

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06'],
              dtype='datetime64[ns]', freq='D')

In [156]:
np.random.randn(4)

array([-2.08474492,  0.33154891, -3.78956105,  0.42948368])

In [157]:
df1 = pd.DataFrame(
    {"A": [1.0, np.nan, 3.0, 5.0, np.nan], "B": [np.nan, 2.0, 3.0, np.nan, 6.0]}
)
df2 = pd.DataFrame(
    {
        "A": [5.0, 2.0, 4.0, np.nan, 3.0, 7.0],
        "B": [np.nan, np.nan, 3.0, 4.0, 6.0, 8.0],
    }
)
df1
df2

     A    B
0  1.0  NaN
1  NaN  2.0
2  3.0  3.0
3  5.0  NaN
4  NaN  6.0

     A    B
0  5.0  NaN
1  2.0  NaN
2  4.0  3.0
3  NaN  4.0
4  3.0  6.0
5  7.0  8.0

In [159]:
df1.combine_first(df2)

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  5.0  4.0
4  3.0  6.0
5  7.0  8.0

In [160]:
def combiner(x, y):
    return np.where(pd.isna(x), y, x)
df1.combine(df2, combiner)

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  5.0  4.0
4  3.0  6.0
5  7.0  8.0

In [167]:
df.A.nunique()

2

In [171]:
df1

     A    B
0  1.0  NaN
1  NaN  2.0
2  3.0  3.0
3  5.0  NaN
4  NaN  6.0

In [174]:
df1.idxmin()
df1.idxmin(axis=1)

A    0
B    1
dtype: int64

0    A
1    B
2    A
3    A
4    B
dtype: object